In [ ]:
import pandas as pd
from pandasql import sqldf


from datetime import datetime

print(datetime.now())

2020-08-25 20:50:09.762445

In [ ]:
nyc_data_sep = pd.read_csv("nyc_sample_data_for_sql_sep_2015.csv")
nyc_data_oct = pd.read_csv("nyc_sample_data_for_sql_oct_2015.csv")

In [ ]:
type(nyc_data_sep)

pandas.core.frame.DataFrame

In [ ]:
pysqldf = lambda q: sqldf(q, globals())

In [ ]:
q = """SELECT * FROM nyc_data_sep;"""

In [ ]:
type(pysqldf(q))

pandas.core.frame.DataFrame

In [ ]:
pysqldf(q).head(10)

,VendorID,lpep_pickup_datetime,Lpep_dropoff_datetime,Store_and_fwd_flag,RateCodeID,Pickup_longitude,Pickup_latitude,Dropoff_longitude,Dropoff_latitude,Passenger_count,...,Tolls_amount,Ehail_fee,improvement_surcharge,Total_amount,Payment_type,Trip_type,lpep_pickup_hour,lpep_pickup_day_of_week,trip_id,driver_id
0,2,2015-09-01 01:17:11,2015-09-01 01:23:01,N,1,-73.830284,40.759506,-73.813698,40.751537,2,...,0.0,None,0.3,7.80,2,1.0,1,Tuesday,1,2
1,2,2015-09-01 02:01:29,2015-09-01 02:22:58,N,1,-73.955322,40.720055,-73.906677,40.684845,1,...,0.0,None,0.3,22.56,1,1.0,2,Tuesday,2,2
2,2,2015-09-01 04:28:56,2015-09-01 04:28:58,N,5,0.000000,0.000000,-73.939354,40.788391,1,...,0.0,None,0.0,15.00,1,2.0,4,Tuesday,3,3
3,2,2015-09-01 06:56:55,2015-09-01 06:59:09,N,1,-73.914764,40.763802,-73.921127,40.766788,1,...,0.0,None,0.3,5.38,1,1.0,6,Tuesday,4,5
4,2,2015-09-01 07:54:44,2015-09-01 07:57:07,N,1,-73.894241,40.864166,-73.897781,40.870739,1,...,0.0,None,0.3,6.24,1,1.0,7,Tuesday,5,2
5,1,2015-09-01 07:55:42,2015-09-01 07:57:02,N,1,-73.945419,40.751495,-73.945435,40.751499,1,...,0.0,None,0.3,3.80,2,1.0,7,Tuesday,6,1
6,1,2015-09-01 08:14:39,2015-09-01 08:17:17,N,1,-73.891426,40.746685,-73.889717,40.739388,1,...,0.0,None,0.3,4.80,2,1.0,8,Tuesday,7,2
7,2,2015-09-01 08:14:46,2015-09-01 08:22:49,N,1,-73.876129,40.770210,-73.893578,40.747528,1,...,0.0,None,0.3,12.96,1,1.0,8,Tuesday,8,2
8,1,2015-09-01 08:42:12,2015-09-01 08:47:41,N,1,-73.942795,40.823231,-73.947701,40.830002,1,...,0.0,None,0.3,7.30,1,1.0,8,Tuesday,9,3
9,2,2015-09-01 09:13:08,2015-09-01 09:17:31,N,1,-73.983406,40.664742,-73.978668,40.670326,1,...,0.0,None,0.3,5.76,1,1.0,9,Tuesday,10,4

In [ ]:
## Possible to assign as a variable
test_df = pysqldf(q)

In [ ]:
test_df.head()

In [ ]:
## Test query
q = """
        SELECT VendorID, sum(Total_amount) as 'Total Revenue' 
        FROM nyc_data_sep
        GROUP BY VendorID;"""

pysqldf(q)

In [ ]:
vendor_summary = pysqldf(q)

vendor_summary

In [ ]:
## Let's start with something fun :)

#  Creating dummy columns
q = """
        SELECT lpep_pickup_datetime, null as'dummy_column_1', 2 as'dummy_column_2', 'dummy_column_3', 4, '5' FROM nyc_data_sep
    """

print(pysqldf(q).dtypes)
pysqldf(q).head()

## Notice the different between 4 and '5'

### Q1

In [ ]:
#    1. Most expensive trip (total amount)
q = """
        SELECT MAX(Total_amount) as 'Max Total Amonut' 
        FROM nyc_data_sep 
    """
pysqldf(q)

In [ ]:
#    1. Most expensive trip (total amount)
# if we want to show the entire row not just the amount

q = """
        SELECT * FROM nyc_data_sep
        ORDER BY Total_amount desc
        LIMIT 1        
    """
pysqldf(q)

In [ ]:
#    1. Most expensive trip (total amount)
# if we want to show the row not just the amount

q = """
        SELECT * FROM nyc_data_sep
        WHERE Total_amount = (SELECT MAX(Total_amount) FROM nyc_data_sep)
        
    """
pysqldf(q)

### Q2

In [ ]:
##    2. Most expensive trip per mile (total amout/mile)

q = """
        SELECT MAX(Total_amount/Trip_distance) as 'Max Dollar/Mile' FROM nyc_data_sep
        
    """
pysqldf(q)

In [ ]:
##    2. Most expensive trip per mile (total amout/mile)
# if we want to show the row not just the amount

q = """
        SELECT *, MAX(Total_amount/Trip_distance) as 'Max Dollar/Mile' FROM nyc_data_sep
        ORDER BY 'Max Dollar/Mile'
        LIMIT 1
    """
pysqldf(q)

## Notice the quote of Max Dollar/Mile in ORDER BY

In [ ]:
##    2. Most expensive trip per mile (total amout/mile)
# if we want to show the row not just the amount

q = """
        SELECT *, MAX(Total_amount/Trip_distance) as 'Max Dollar/Mile' FROM nyc_data_sep
        WHERE 'Max Dollar/Mile' = (SELECT MAX('Max Dollar/Mile') FROM nyc_data_sep)
    """
print(pysqldf(q).dtypes) ## No need to print this.
pysqldf(q)

## Notice the quote of Max Dollar/Mile in WHERE and MAX

### Q3

In [ ]:
##   3. Most generous trip (highest tip)

q = """
        SELECT MAX(Tip_amount) as 'Most Generous Tip' FROM nyc_data_sep
    """
pysqldf(q)

In [ ]:
##   3. Most generous trip (highest tip)
# if we want to show the row not just the amount

q = """
        SELECT *, MAX(Tip_amount) as 'Most Generous Tip' FROM nyc_data_sep
        ORDER BY 'Most Generous Tip'
        LIMIT 1
    """
pysqldf(q)

## Notice the quote of Most Generous Tip in ORDER BY

In [ ]:
##   3. Most generous trip (highest tip)
# if we want to show the row not just the amount

q = """
        SELECT *, MAX(Tip_amount) as 'Most Generous Tip' FROM nyc_data_sep
        WHERE 'Most Generous Tip' = (SELECT MAX('Most Generous Tip') FROM nyc_data_sep)
    """
pysqldf(q)

## Notice the quote of Most Generous Tip in WHERE and MAX

### Q4

In [ ]:
##    4. Longest trip duration

q = """
        SELECT MAX(CAST(strftime('%s', Lpep_dropoff_datetime) as integer) - CAST(strftime('%s', lpep_pickup_datetime) as integer)) as 'MAX Trip Duration (Seconds)'
        FROM nyc_data_sep
    """

print(pysqldf(q).dtypes)
pysqldf(q)

In [ ]:
## As we did in Q1, Q2 and Q3 we can show the entire row.

## Homework for DataScienceUS team: Show the entire row by:
##  1. ORDER BY
##  2. WHERE
## (like in Q1, Q2 and Q3)

### Q5

In [ ]:
##    5. Mean tip by hour

q = """
        SELECT strftime('%H', lpep_pickup_datetime) as 'Hour', avg(Tip_amount) as 'Average Tip'
        FROM nyc_data_sep
        GROUP BY Hour
    """

print(pysqldf(q).dtypes)

pysqldf(q).head(5)

In [ ]:
##    5. Mean tip by hour
##    Alternative: Writing column number instead of column name in group by

q = """
        SELECT strftime('%H', lpep_pickup_datetime) as 'Hour', avg(Tip_amount) as 'Average Tip'
        FROM nyc_data_sep
        GROUP BY 1
    """

print(pysqldf(q).dtypes)

pysqldf(q).head(5)

In [ ]:
##    5. Mean tip by hour

### Notice that the code is failing, that is it does not give the intented result. Guess why?

q = """
        SELECT strftime('%H', lpep_pickup_datetime) as 'Hour', avg(Tip_amount) as 'Average Tip'
        FROM nyc_data_sep
        GROUP BY 'Hour'
    """

print(pysqldf(q).dtypes)

pysqldf(q)

### Q6

In [ ]:
# ##   6. Median trip cost

# q = """

#         Editor's note: The answer will be added later.
    

#     """

# print(pysqldf(q).dtypes)

# pysqldf(q).head(10)

### Q7

In [ ]:
##    7. Average total trip by day of week (Fortunately, we have day of week information. 
## Otherwise, need to create a new date column without hours from date column. 
## Then, need to create "day of week" column, i.e Monday, Tuesday .. or 1, 2 ..,  from that new date column. 
## Total trip count should be found for each day, lastly average total trip should be calculated for each day)


## Let's do step by step. 
## Note that a new Day_of_Week column is created although original data has this info. This is for demonstaration purpose. 
## Alternative solution will use the orginial day of week information instead of creating a new one.

## The output of this query is trip count is each day, i.e 20150903, with day of week information
## Note that 0 is Sunday

q = """
        SELECT strftime('%Y%m%d', lpep_pickup_datetime) as 'Date', 
                strftime('%w', lpep_pickup_datetime) as 'Day_of_Week',
                COUNT(*) as 'Daily_Trip_Count'
        FROM nyc_data_sep
        GROUP BY Date

    """

pysqldf(q).head(10)

In [ ]:
## Let's put the query above in another query. You usually don't need to do that. I did so for demonstration purpose.
## Note that there are 2 select statements. 

q = """  SELECT * FROM
        (SELECT strftime('%Y%m%d', lpep_pickup_datetime) as 'Date', 
                strftime('%w', lpep_pickup_datetime) as 'Day_of_Week',
                COUNT(*) as 'Daily_Trip_Count'
        FROM nyc_data_sep
        GROUP BY Date)

    """

pysqldf(q).head(10)

In [ ]:
## I can select any column from the inner query and use it in the outer query.

q = """  SELECT Date, Daily_Trip_Count FROM
        (SELECT strftime('%Y%m%d', lpep_pickup_datetime) as 'Date', 
                strftime('%w', lpep_pickup_datetime) as 'Day_of_Week',
                COUNT(*) as 'Daily_Trip_Count'
        FROM nyc_data_sep
        GROUP BY Date)

    """

pysqldf(q).head(10)

In [ ]:
## We can also do operations, i.e. aggregation, on these columns
## Notice that we have two group by statements. The latter is for the outer query.


q = """  SELECT Day_of_Week, AVG(Daily_Trip_Count) as Average_Daily_Trip_Count FROM
        (SELECT strftime('%Y%m%d', lpep_pickup_datetime) as 'Date', 
                strftime('%w', lpep_pickup_datetime) as 'Day_of_Week',
                COUNT(*) as 'Daily_Trip_Count'
        FROM nyc_data_sep
        GROUP BY Date)
        GROUP BY Day_of_Week

    """

print(pysqldf(q).dtypes)
pysqldf(q).head(10)

In [ ]:
## Making it more understable by recoding 0, 1 etc to Sunday, Monday etc


q = """  SELECT 
        CASE WHEN Day_of_Week = '0' THEN 'Sunday'
             WHEN Day_of_Week = '1' THEN 'Monday'
             WHEN Day_of_Week = '2' THEN 'Tuesday'
             WHEN Day_of_Week = '3' THEN 'Wednesday'
             WHEN Day_of_Week = '4' THEN 'Thursday'
             WHEN Day_of_Week = '5' THEN 'Friday'
             WHEN Day_of_Week = '6' THEN 'Saturday'
            END as Day_of_Week,
        AVG(Daily_Trip_Count) as Average_Daily_Trip_Count FROM
        (SELECT strftime('%Y%m%d', lpep_pickup_datetime) as 'Date', 
                strftime('%w', lpep_pickup_datetime) as 'Day_of_Week',
                COUNT(*) as 'Daily_Trip_Count'
        FROM nyc_data_sep
        GROUP BY Date)
        GROUP BY Day_of_Week
        ORDER BY Average_Daily_Trip_Count
    """

print(pysqldf(q).dtypes)
pysqldf(q).head(10)

## Since Day_of_Week is object, we check for '0', '1' etc instead of 0, 1

In [ ]:
# Alternative by using the original day of week information instead of creating a new one.

q = """  SELECT lpep_pickup_day_of_week, AVG(Daily_Trip_Count) as Average_Daily_Trip_Count FROM
        (SELECT strftime('%Y%m%d', lpep_pickup_datetime) as 'Date', 
                lpep_pickup_day_of_week,
                COUNT(*) as 'Daily_Trip_Count'
        FROM nyc_data_sep
        GROUP BY Date)
        GROUP BY lpep_pickup_day_of_week

    """

print(pysqldf(q).dtypes)
pysqldf(q).head(10)

Notice that we solved this problem through so-called "subquery".

### Q8

In [ ]:
##  8. Count of trips by hour (Luckily, we have hour column. Otherwise, a new hour column should be created from date column,
## then count trip by hour)

## Instead of using'lpep_pickup_hour', I create hour column by myself for practice purpose

q = """
        SELECT strftime('%H', lpep_pickup_datetime) as 'Hour', count(*) as 'Trip Count'
        FROM nyc_data_sep
        GROUP BY Hour
    """

print(pysqldf(q).dtypes)

pysqldf(q).head(15)

### Q9

In [ ]:
###    9. Average passenger count per trip 

q = """
        SELECT AVG(Passenger_count) as 'AVG_PAX_PER_TRIP'
        FROM nyc_data_sep
    """

print(pysqldf(q).dtypes)

pysqldf(q)

### Q10

In [ ]:
#   10. Average passenger count per trip by hour

q = """
        SELECT strftime('%H', lpep_pickup_datetime) as 'Hour', AVG(Passenger_count) as 'Avg_Pax_Per_Trip'
        FROM nyc_data_sep
        GROUP BY Hour
    """

print(pysqldf(q).dtypes)

pysqldf(q).head(15)

In [ ]:
## Here is a long solution

q = """
        SELECT strftime('%H',lpep_pickup_datetime) as 'Hour', SUM(Passenger_count) as 'Total_Pax',
        COUNT(*) as 'Trip_Count', CAST('Total_Pax'/'Trip_Count' as float)
        as 'Avg_Pax_Per_Trip'
        FROM nyc_data_sep
        GROUP BY Hour
    """

print(pysqldf(q).dtypes)

pysqldf(q).head(15)

## Why does this not spit the output we want? Any guess?

In [ ]:
q = """
        SELECT Hour, Total_Pax/Trip_Count as 'Avg_Pax_Per_Trip' FROM
        (SELECT strftime('%H', lpep_pickup_datetime) as 'Hour', SUM(Passenger_count) as 'Total_Pax',
        COUNT(*) as 'Trip_Count', 'dummy' as 'Avg_Pax_Per_Trip'
        FROM nyc_data_sep
        GROUP BY Hour)
    """

print(pysqldf(q).dtypes)

pysqldf(q).head(15)

## Is this the right output? Check Avg_Pax_Per_Trip, which is 1

In [ ]:
## How about this trick?

q = """
        SELECT Hour, Total_Pax*1.0/Trip_Count as 'Avg_Pax_Per_Trip' FROM
        (SELECT strftime('%H', lpep_pickup_datetime) as 'Hour', SUM(Passenger_count) as 'Total_Pax',
        COUNT(*) as 'Trip_Count', 'dummy' as 'Avg_Pax_Per_Trip'
        FROM nyc_data_sep
        GROUP BY Hour)
    """

print(pysqldf(q).dtypes)

pysqldf(q).head(15)

## Notice 1.0 in the select column. Actually, multiplying integer with float ends up as float. Pretty neat!

### Q11

In [ ]:
##   11. Which airport welcomes more passenger: JFK or EWR? 
## Tip: check RateCodeID from data dictionary for the definition (2: JFK, 3: Newark)

q = """
        SELECT RateCodeID, SUM(Passenger_count) as 'Total_Passenger'
        FROM nyc_data_sep
        WHERE RateCodeID = 2 OR RateCodeID = 3
        GROUP BY RateCodeID
    """

print(pysqldf(q).dtypes)

pysqldf(q).head(15)

In [ ]:
## How about this solution? 

q = """
        SELECT RateCodeID, SUM(Passenger_count) as 'Total_Passenger'
        FROM nyc_data_sep
        GROUP BY RateCodeID
        HAVING RateCodeID = 2 OR RateCodeID = 3
    """

print(pysqldf(q).dtypes)

pysqldf(q).head(15)

In [ ]:
## Homework for DataScienceUS team:
## - What is the difference between 2 solution?
## - Google WHERE vs HAVING please!

In [ ]:
## Here is a more readable solution

q = """
        SELECT 
        CASE WHEN RateCodeID = 2 THEN 'JFK'
             WHEN RateCodeID = 3 THEN 'EWR' END as 'Airport',
        SUM(Passenger_count) as 'Total_Passenger'
        FROM nyc_data_sep
        GROUP BY RateCodeID
        HAVING Airport = 'JFK' OR Airport = 'EWR'
    """

print(pysqldf(q).dtypes)

pysqldf(q)

## We recoded 2 and 3 as JFK and EWR

In [ ]:
## Could you notice the difference between this solution and the above one? Check having condition in both solution (Airport vs RateCodeID)

q = """
        SELECT 
        CASE WHEN RateCodeID = 2 THEN 'JFK'
             WHEN RateCodeID = 3 THEN 'EWR' END as 'Airport', 
             SUM(Passenger_count) as 'Total_Passenger'
        FROM nyc_data_sep
        GROUP BY RateCodeID
        HAVING RateCodeID = 2 OR RateCodeID = 3
    """

print(pysqldf(q).dtypes)

pysqldf(q).head(15)

### Q12

In [ ]:
## 12. How many nulls are there in Total_amount?

q = """
        SELECT COUNT(*) Missing_Total_Amount
        FROM nyc_data_sep
        where Total_amount is null

        
    """
pysqldf(q).head()

In [ ]:
## 12. How many nulls are there in Total_amount?

# How about this? Is this a correct query? What is the risk?
# Homework: Search "how to count null values in SQL"

q = """
        SELECT COUNT(Total_amount) Missing_Total_Amount
        FROM nyc_data_sep
        where Total_amount is null

        
    """
pysqldf(q).head()

### Q13

In [ ]:
## 13. How many values are there in Trip_distance? (count of non-missing values)


q = """
        SELECT COUNT(Trip_distance) Non_missing_trip_distance
        FROM nyc_data_sep
        where Trip_distance is not null

        
    """
pysqldf(q).head()

### Q14

In [ ]:
## 14. How many nulls are there in Ehail_fee? 


q = """
        SELECT count(Ehail_fee) Missing_Ehail_Fee
        FROM nyc_data_sep
        WHERE Ehail_fee is null
        
    """
pysqldf(q).head()

## Oops. Is this the anticipated result?

In [ ]:
## 18. How many nulls are there in Ehail_fee? 


q = """
        SELECT count(*) Missing_Ehail_Fee FROM
        (SELECT Ehail_fee
        FROM nyc_data_sep
        WHERE Ehail_fee is null)

        
    """
pysqldf(q).head()

## Homework: How to count null values in SQL? Refer to the 2nd answer of Q12.

### Q15

In [ ]:
## Q15. Find the trips of which trip distance is greater than 15 miles (included) or less than 0.1 mile (included).
## It is possible to write this with only one where statement. However, this time write two queries and "union" them.
## The purpose of this question is to use union function. You can consider this question as finding outliers in 
## a quick and dirty way, which you would do in your professional life too often.

q = """
        SELECT *
        FROM nyc_data_sep
        WHERE Trip_distance <=0.1
        UNION ALL
        SELECT *
        FROM nyc_data_sep
        WHERE Trip_distance >=15
        
    """



print(len(pysqldf(q)))
pysqldf(q).head()

## Homework: UNION vs UNION ALL

### Q16

In [ ]:
##  16. We would like to see the distribution (not like histogram) of Total_amount. Could you create buckets, or price range, 
## for Total_amount and find how many trips there are in each buckets? Each range would be 5, until 35, i.e. 0-5, 5-10,
## 10-15 … 30-35, +35.

# Alternative 1

# Step 1: Create buckets for each total amount. This query will be "inner query"

q = """
        SELECT Total_amount,
               CASE WHEN Total_amount < 5 THEN '0 - 5'
                    WHEN Total_amount >= 5 AND Total_amount < 10 THEN '10 - 15'
                    WHEN Total_amount >= 10 AND Total_amount < 15 THEN '10 - 15'
                    WHEN Total_amount >= 15 AND Total_amount < 20 THEN '15 - 20'
                    WHEN Total_amount >= 20 AND Total_amount < 25 THEN '20 - 25'
                    WHEN Total_amount >= 25 AND Total_amount < 30 THEN '25 - 30'
                    WHEN Total_amount >= 30 AND Total_amount < 35 THEN '30 - 35'
                    WHEN Total_amount >= 35 THEN '35+' END as Payment_Range_in_Dollars
        FROM nyc_data_sep
        
    """
print(len(pysqldf(q)))
pysqldf(q).head(10)

In [ ]:
##  16. We would like to see the distribution (not like histogram) of Total_amount. Could you create buckets, or price range, 
## for Total_amount and find how many trips there are in each buckets? Each range would be 5, until 35, i.e. 0-5, 5-10,
## 10-15 … 30-35, +35.

# Alternative 1

# Step 2: Count trips with outer query.

q = """
        SELECT Payment_Range_in_Dollars, count(*) Trip_Count FROM
        (SELECT Total_amount,
               CASE WHEN Total_amount < 5 THEN '0 - 5'
                    WHEN Total_amount >= 5 AND Total_amount < 10 THEN '10 - 15'
                    WHEN Total_amount >= 10 AND Total_amount < 15 THEN '10 - 15'
                    WHEN Total_amount >= 15 AND Total_amount < 20 THEN '15 - 20'
                    WHEN Total_amount >= 20 AND Total_amount < 25 THEN '20 - 25'
                    WHEN Total_amount >= 25 AND Total_amount < 30 THEN '25 - 30'
                    WHEN Total_amount >= 30 AND Total_amount < 35 THEN '30 - 35'
                    WHEN Total_amount >= 35 THEN '35+' END as Payment_Range_in_Dollars
        FROM nyc_data_sep)
        GROUP BY Payment_Range_in_Dollars
        
    """
pysqldf(q)

In [ ]:
##  16. We would like to see the distribution (not like histogram) of Total_amount. Could you create buckets, or price range, 
## for Total_amount and find how many trips there are in each buckets? Each range would be 5, until 35, i.e. 0-5, 5-10,
## 10-15 … 30-35, +35.

# Alternative 2

# How about this?


q = """
        SELECT 
               CASE WHEN Total_amount < 5 THEN '0 - 5'
                    WHEN Total_amount >= 5 AND Total_amount < 10 THEN '10 - 15'
                    WHEN Total_amount >= 10 AND Total_amount < 15 THEN '10 - 15'
                    WHEN Total_amount >= 15 AND Total_amount < 20 THEN '15 - 20'
                    WHEN Total_amount >= 20 AND Total_amount < 25 THEN '20 - 25'
                    WHEN Total_amount >= 25 AND Total_amount < 30 THEN '25 - 30'
                    WHEN Total_amount >= 30 AND Total_amount < 35 THEN '30 - 35'
                    WHEN Total_amount >= 35 THEN '35+' END as Payment_Range_in_Dollars,
                COUNT(*) Trip_Count
        FROM nyc_data_sep
        GROUP BY Payment_Range_in_Dollars
        
    """
pysqldf(q)